In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [19]:
tanic = pd.read_csv('/Users/moric/sand/meetup/wcd/py/titanic.csv')
print(tanic)

## Load Dinesafe data
## pd.read_csv('/Users/moric/sand/meetup/wcd/py/dinesafe.csv')

      pclass  survived                                               name  \
0          1         1                      Allen, Miss. Elisabeth Walton
1          1         1                     Allison, Master. Hudson Trevor
2          1         0                       Allison, Miss. Helen Loraine
3          1         0               Allison, Mr. Hudson Joshua Creighton
4          1         0    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5          1         1                                Anderson, Mr. Harry
6          1         1                  Andrews, Miss. Kornelia Theodosia
7          1         0                             Andrews, Mr. Thomas Jr
8          1         1      Appleton, Mrs. Edward Dale (Charlotte Lamson)
9          1         0                            Artagaveytia, Mr. Ramon
10         1         0                             Astor, Col. John Jacob
11         1         1  Astor, Mrs. John Jacob (Madeleine Talmadge Force)
12         1         1                      Aubart, Mme. Leontine Pauline
13         1         1                       Barber, Miss. Ellen "Nellie"
14         1         1               Barkworth, Mr. Algernon Henry Wilson
15         1         0                                Baumann, Mr. John D
16         1         0                           Baxter, Mr. Quigg Edmond
17         1         1    Baxter, Mrs. James (Helene DeLaudeniere Chaput)
18         1         1                              Bazzani, Miss. Albina
19         1         0                               Beattie, Mr. Thomson
20         1         1                      Beckwith, Mr. Richard Leonard
21         1         1   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
22         1         1                              Behr, Mr. Karl Howell
23         1         1                              Bidois, Miss. Rosalie
24         1         1                                  Bird, Miss. Ellen
25         1         0                                Birnbaum, Mr. Jakob
26         1         1                            Bishop, Mr. Dickinson H
27         1         1            Bishop, Mrs. Dickinson H (Helen Walton)
28         1         1                             Bissette, Miss. Amelia
29         1         1          Bjornstrom-Steffansson, Mr. Mauritz Hakan
...      ...       ...                                                ...
1278       3         0               Vestrom, Miss. Hulda Amanda Adolfina
1279       3         0                                    Vovk, Mr. Janko
1280       3         0                               Waelens, Mr. Achille
1281       3         0                                Ware, Mr. Frederick
1282       3         0                        Warren, Mr. Charles William
1283       3         0                                  Webber, Mr. James
1284       3         0                                Wenzel, Mr. Linhart
1285       3         1    Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
1286       3         0                   Widegren, Mr. Carl/Charles Peter
1287       3         0                          Wiklund, Mr. Jakob Alfred
1288       3         0                            Wiklund, Mr. Karl Johan
1289       3         1                   Wilkes, Mrs. James (Ellen Needs)
1290       3         0                   Willer, Mr. Aaron ("Abi Weller")
1291       3         0                                 Willey, Mr. Edward
1292       3         0                  Williams, Mr. Howard Hugh "Harry"
1293       3         0                               Williams, Mr. Leslie
1294       3         0                                Windelov, Mr. Einar
1295       3         0                                   Wirz, Mr. Albert
1296       3         0                             Wiseman, Mr. Phillippe
1297       3         0                          Wittevrongel, Mr. Camille
1298       3         0                                Yasbeck, Mr. Antoni
1299       3         1            Yasbeck, Mrs. Antoni (Selini Alexander)
1300       3         0                               Youseff, Mr. Gerious
1301       3         0                                  Yousif, Mr. Wazli
1302       3         0                              Yousseff, Mr. Gerious
1303       3         0                               Zabour, Miss. Hileni
1304       3         0                              Zabour, Miss. Thamine
1305       3         0                          Zakarian, Mr. Mapriededer
1306       3         0                                Zakarian, Mr. Ortin
1307       3         0                                 Zimmerman, Mr. Leo

         sex      age  sibsp  parch            ticket      fare    cabin  \
0     female  29.0000      0      0             24160  211.3375       B5
1       male   0.9167      1      2            113781  151.5500  C22 C26
2     female   2.0000      1      2            113781  151.5500  C22 C26
3       male  30.0000      1      2            113781  151.5500  C22 C26
4     female  25.0000      1      2            113781  151.5500  C22 C26
5       male  48.0000      0      0             19952   26.5500      E12
6     female  63.0000      1      0             13502   77.9583       D7
7       male  39.0000      0      0            112050    0.0000      A36
8     female  53.0000      2      0             11769   51.4792     C101
9       male  71.0000      0      0          PC 17609   49.5042      NaN
10      male  47.0000      1      0          PC 17757  227.5250  C62 C64
11    female  18.0000      1      0          PC 17757  227.5250  C62 C64
12    female  24.0000      0      0          PC 17477   69.3000      B35
13    female  26.0000      0      0             19877   78.8500      NaN
14      male  80.0000      0      0             27042   30.0000      A23
15      male      NaN      0      0          PC 17318   25.9250      NaN
16      male  24.0000      0      1          PC 17558  247.5208  B58 B60
17    female  50.0000      0      1          PC 17558  247.5208  B58 B60
18    female  32.0000      0      0             11813   76.2917      D15
19      male  36.0000      0      0             13050   75.2417       C6
20      male  37.0000      1      1             11751   52.5542      D35
21    female  47.0000      1      1             11751   52.5542      D35
22      male  26.0000      0      0            111369   30.0000     C148
23    female  42.0000      0      0          PC 17757  227.5250      NaN
24    female  29.0000      0      0          PC 17483  221.7792      C97
25      male  25.0000      0      0             13905   26.0000      NaN
26      male  25.0000      1      0             11967   91.0792      B49
27    female  19.0000      1      0             11967   91.0792      B49
28    female  35.0000      0      0          PC 17760  135.6333      C99
29      male  28.0000      0      0            110564   26.5500      C52
...      ...      ...    ...    ...               ...       ...      ...
1278  female  14.0000      0      0            350406    7.8542      NaN
1279    male  22.0000      0      0            349252    7.8958      NaN
1280    male  22.0000      0      0            345767    9.0000      NaN
1281    male      NaN      0      0            359309    8.0500      NaN
1282    male      NaN      0      0        C.A. 49867    7.5500      NaN
1283    male      NaN      0      0  SOTON/OQ 3101316    8.0500      NaN
1284    male  32.5000      0      0            345775    9.5000      NaN
1285  female  38.0000      0      0              2688    7.2292      NaN
1286    male  51.0000      0      0            347064    7.7500      NaN
1287    male  18.0000      1      0           3101267    6.4958      NaN
1288    male  21.0000      1      0           3101266    6.4958      NaN
1289  female  47.0000      1      0            363272    7.0000      NaN
1290    male      NaN      0      0              3410    8.7125      NaN
1291    male      NaN      0      0     S.O./P.P. 751    7.5500      NaN
1292    male      NaN      0      0          A/5 2466    8.0500      NaN
1293    male  28.5000      0      0             54636   16.1000      NaN
1294    male  21.0000      0      0  SOTON/OQ 3101317    7.2500      NaN
1295    male  27.0000      0      0            315154    8.6625      NaN
1296    male      NaN      0      0        A/4. 34244    7.2500      NaN
1297    male  36.0000      0      0            345771    9.5000      NaN
1298    male  27.0000      1      0              2659   14.4542      NaN
1299  female  15.0000      1      0              2659   14.4542      NaN
1300    male  45.5000      0      0              2628    7.2250      NaN
1301    male      NaN      0      0              2647    7.2250      NaN
1302    male      NaN      0      0              2627   14.4583      NaN
1303  female  14.5000      1      0              2665   14.4542      NaN
1304  female      NaN      1      0              2665   14.4542      NaN
1305    male  26.5000      0      0              2656    7.2250      NaN
1306    male  27.0000      0      0              2670    7.2250      NaN
1307    male  29.0000      0      0            315082    7.8750      NaN

     embarked boat   body                           home.dest
0           S    2    NaN                        St Louis, MO
1           S   11    NaN     Montreal, PQ / Chesterville, ON
2           S  NaN    NaN     Montreal, PQ / Chesterville, ON
3           S  NaN  135.0     Montreal, PQ / Chesterville, ON
4           S  NaN    NaN     Montreal, PQ / Chesterville, ON
5           S    3    NaN                        New York, NY
6           S   10    NaN                          Hudson, NY
7           S  NaN    NaN                         Belfast, NI
8           S    D    NaN                 Bayside, Queens, NY
9           C  NaN   22.0                 Montevideo, Uruguay
10          C  NaN  124.0                        New York, NY
11          C    4    NaN                        New York, NY
12          C    9    NaN                       Paris, France
13          S    6    NaN                                 NaN
14          S    B    NaN                       Hessle, Yorks
15          S  NaN    NaN                        New York, NY
16          C  NaN    NaN                        Montreal, PQ
17          C    6    NaN                        Montreal, PQ
18          C    8    NaN                                 NaN
19          C    A    NaN                        Winnipeg, MN
20          S    5    NaN                        New York, NY
21          S    5    NaN                        New York, NY
22          C    5    NaN                        New York, NY
23          C    4    NaN                                 NaN
24          S    8    NaN                                 NaN
25          C  NaN  148.0                   San Francisco, CA
26          C    7    NaN                        Dowagiac, MI
27          C    7    NaN                        Dowagiac, MI
28          S    8    NaN                                 NaN
29          S    D    NaN  Stockholm, Sweden / Washington, DC
...       ...  ...    ...                                 ...
1278        S  NaN    NaN                                 NaN
1279        S  NaN    NaN                                 NaN
1280        S  NaN    NaN      Antwerp, Belgium / Stanton, OH
1281        S  NaN    NaN                                 NaN
1282        S  NaN    NaN                                 NaN
1283        S  NaN    NaN                                 NaN
1284        S  NaN  298.0                                 NaN
1285        C    C    NaN                                 NaN
1286        S  NaN    NaN                                 NaN
1287        S  NaN  314.0                                 NaN
1288        S  NaN    NaN                                 NaN
1289        S  NaN    NaN                                 NaN
1290        S  NaN    NaN                                 NaN
1291        S  NaN    NaN                                 NaN
1292        S  NaN    NaN                                 NaN
1293        S  NaN   14.0                                 NaN
1294        S  NaN    NaN                                 NaN
1295        S  NaN  131.0                                 NaN
1296        S  NaN    NaN                                 NaN
1297        S  NaN    NaN                                 NaN
1298        C    C    NaN                                 NaN
1299        C  NaN    NaN                                 NaN
1300        C  NaN  312.0                                 NaN
1301        C  NaN    NaN                                 NaN
1302        C  NaN    NaN                                 NaN
1303        C  NaN  328.0                                 NaN
1304        C  NaN    NaN                                 NaN
1305        C  NaN  304.0                                 NaN
1306        C  NaN    NaN                                 NaN
1307        S  NaN    NaN                                 NaN

[1308 rows x 14 columns]

In [20]:
tanic.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [23]:
## random selected lines
tanic.tail(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1298,3,0,"Yasbeck, Mr. Antoni",male,27.0,1,0,2659,14.4542,NaN,C,C,NaN,NaN
1299,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN
1300,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN
1301,3,0,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C,NaN,NaN,NaN
1302,3,0,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C,NaN,NaN,NaN
1303,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1304,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1305,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1306,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1307,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [22]:
tanic.sample(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
572,2,1,"Trout, Mrs. William H (Jessie L)",female,28.0,0,0,240929,12.6500,NaN,S,NaN,NaN,"Columbus, OH"
679,3,0,"Boulos, Miss. Nourelain",female,9.0,1,1,2678,15.2458,NaN,C,NaN,NaN,"Syria Kent, ON"
542,2,1,"Quick, Mrs. Frederick Charles (Jane Richards)",female,33.0,0,2,26360,26.0000,NaN,S,11,NaN,"Plymouth, Devon / Detroit, MI"
840,3,0,"Haas, Miss. Aloisia",female,24.0,0,0,349236,8.8500,NaN,S,NaN,NaN,NaN
1224,3,0,"Stanley, Mr. Edward Roland",male,21.0,0,0,A/4 45380,8.0500,NaN,S,NaN,NaN,NaN
1074,3,0,"O'Connor, Mr. Patrick",male,NaN,0,0,366713,7.7500,NaN,Q,NaN,NaN,NaN
900,3,0,"Johnston, Master. William Arthur ""Willie""",male,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN,NaN,NaN
1041,3,0,"Murdlin, Mr. Joseph",male,NaN,0,0,A./5. 3235,8.0500,NaN,S,NaN,NaN,NaN
52,1,0,"Carrau, Mr. Francisco M",male,28.0,0,0,113059,47.1000,NaN,S,NaN,NaN,"Montevideo, Uruguay"
1022,3,0,"Mitkoff, Mr. Mito",male,NaN,0,0,349221,7.8958,NaN,S,NaN,NaN,NaN

In [51]:
sel_tanic = tanic[['survived', 'name', 'sex', 'age', 'ticket', 'fare']]
print(sel_tanic)

      survived                                               name     sex  \
0            1                      Allen, Miss. Elisabeth Walton  female
1            1                     Allison, Master. Hudson Trevor    male
2            0                       Allison, Miss. Helen Loraine  female
3            0               Allison, Mr. Hudson Joshua Creighton    male
4            0    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
5            1                                Anderson, Mr. Harry    male
6            1                  Andrews, Miss. Kornelia Theodosia  female
7            0                             Andrews, Mr. Thomas Jr    male
8            1      Appleton, Mrs. Edward Dale (Charlotte Lamson)  female
9            0                            Artagaveytia, Mr. Ramon    male
10           0                             Astor, Col. John Jacob    male
11           1  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  female
12           1                      Aubart, Mme. Leontine Pauline  female
13           1                       Barber, Miss. Ellen "Nellie"  female
14           1               Barkworth, Mr. Algernon Henry Wilson    male
15           0                                Baumann, Mr. John D    male
16           0                           Baxter, Mr. Quigg Edmond    male
17           1    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female
18           1                              Bazzani, Miss. Albina  female
19           0                               Beattie, Mr. Thomson    male
20           1                      Beckwith, Mr. Richard Leonard    male
21           1   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female
22           1                              Behr, Mr. Karl Howell    male
23           1                              Bidois, Miss. Rosalie  female
24           1                                  Bird, Miss. Ellen  female
25           0                                Birnbaum, Mr. Jakob    male
26           1                            Bishop, Mr. Dickinson H    male
27           1            Bishop, Mrs. Dickinson H (Helen Walton)  female
28           1                             Bissette, Miss. Amelia  female
29           1          Bjornstrom-Steffansson, Mr. Mauritz Hakan    male
...        ...                                                ...     ...
1278         0               Vestrom, Miss. Hulda Amanda Adolfina  female
1279         0                                    Vovk, Mr. Janko    male
1280         0                               Waelens, Mr. Achille    male
1281         0                                Ware, Mr. Frederick    male
1282         0                        Warren, Mr. Charles William    male
1283         0                                  Webber, Mr. James    male
1284         0                                Wenzel, Mr. Linhart    male
1285         1    Whabee, Mrs. George Joseph (Shawneene Abi-Saab)  female
1286         0                   Widegren, Mr. Carl/Charles Peter    male
1287         0                          Wiklund, Mr. Jakob Alfred    male
1288         0                            Wiklund, Mr. Karl Johan    male
1289         1                   Wilkes, Mrs. James (Ellen Needs)  female
1290         0                   Willer, Mr. Aaron ("Abi Weller")    male
1291         0                                 Willey, Mr. Edward    male
1292         0                  Williams, Mr. Howard Hugh "Harry"    male
1293         0                               Williams, Mr. Leslie    male
1294         0                                Windelov, Mr. Einar    male
1295         0                                   Wirz, Mr. Albert    male
1296         0                             Wiseman, Mr. Phillippe    male
1297         0                          Wittevrongel, Mr. Camille    male
1298         0                                Yasbeck, Mr. Antoni    male
1299         1            Yasbeck, Mrs. Antoni (Selini Alexander)  female
1300         0                               Youseff, Mr. Gerious    male
1301         0                                  Yousif, Mr. Wazli    male
1302         0                              Yousseff, Mr. Gerious    male
1303         0                               Zabour, Miss. Hileni  female
1304         0                              Zabour, Miss. Thamine  female
1305         0                          Zakarian, Mr. Mapriededer    male
1306         0                                Zakarian, Mr. Ortin    male
1307         0                                 Zimmerman, Mr. Leo    male

          age            ticket      fare
0     29.0000             24160  211.3375
1      0.9167            113781  151.5500
2      2.0000            113781  151.5500
3     30.0000            113781  151.5500
4     25.0000            113781  151.5500
5     48.0000             19952   26.5500
6     63.0000             13502   77.9583
7     39.0000            112050    0.0000
8     53.0000             11769   51.4792
9     71.0000          PC 17609   49.5042
10    47.0000          PC 17757  227.5250
11    18.0000          PC 17757  227.5250
12    24.0000          PC 17477   69.3000
13    26.0000             19877   78.8500
14    80.0000             27042   30.0000
15        NaN          PC 17318   25.9250
16    24.0000          PC 17558  247.5208
17    50.0000          PC 17558  247.5208
18    32.0000             11813   76.2917
19    36.0000             13050   75.2417
20    37.0000             11751   52.5542
21    47.0000             11751   52.5542
22    26.0000            111369   30.0000
23    42.0000          PC 17757  227.5250
24    29.0000          PC 17483  221.7792
25    25.0000             13905   26.0000
26    25.0000             11967   91.0792
27    19.0000             11967   91.0792
28    35.0000          PC 17760  135.6333
29    28.0000            110564   26.5500
...       ...               ...       ...
1278  14.0000            350406    7.8542
1279  22.0000            349252    7.8958
1280  22.0000            345767    9.0000
1281      NaN            359309    8.0500
1282      NaN        C.A. 49867    7.5500
1283      NaN  SOTON/OQ 3101316    8.0500
1284  32.5000            345775    9.5000
1285  38.0000              2688    7.2292
1286  51.0000            347064    7.7500
1287  18.0000           3101267    6.4958
1288  21.0000           3101266    6.4958
1289  47.0000            363272    7.0000
1290      NaN              3410    8.7125
1291      NaN     S.O./P.P. 751    7.5500
1292      NaN          A/5 2466    8.0500
1293  28.5000             54636   16.1000
1294  21.0000  SOTON/OQ 3101317    7.2500
1295  27.0000            315154    8.6625
1296      NaN        A/4. 34244    7.2500
1297  36.0000            345771    9.5000
1298  27.0000              2659   14.4542
1299  15.0000              2659   14.4542
1300  45.5000              2628    7.2250
1301      NaN              2647    7.2250
1302      NaN              2627   14.4583
1303  14.5000              2665   14.4542
1304      NaN              2665   14.4542
1305  26.5000              2656    7.2250
1306  27.0000              2670    7.2250
1307  29.0000            315082    7.8750

[1308 rows x 6 columns]

In [54]:
## data
## selected col titles in data
sel_tanic

,survived,name,sex,age,ticket,fare
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,24160,211.3375
1,1,"Allison, Master. Hudson Trevor",male,0.9167,113781,151.5500
2,0,"Allison, Miss. Helen Loraine",female,2.0000,113781,151.5500
3,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,113781,151.5500
4,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,113781,151.5500
5,1,"Anderson, Mr. Harry",male,48.0000,19952,26.5500
6,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,13502,77.9583
7,0,"Andrews, Mr. Thomas Jr",male,39.0000,112050,0.0000
8,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,11769,51.4792
9,0,"Artagaveytia, Mr. Ramon",male,71.0000,PC 17609,49.5042
10,0,"Astor, Col. John Jacob",male,47.0000,PC 17757,227.5250
11,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0000,PC 17757,227.5250
12,1,"Aubart, Mme. Leontine Pauline",female,24.0000,PC 17477,69.3000
13,1,"Barber, Miss. Ellen ""Nellie""",female,26.0000,19877,78.8500
14,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0000,27042,30.0000
15,0,"Baumann, Mr. John D",male,NaN,PC 17318,25.9250
16,0,"Baxter, Mr. Quigg Edmond",male,24.0000,PC 17558,247.5208
17,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0000,PC 17558,247.5208
18,1,"Bazzani, Miss. Albina",female,32.0000,11813,76.2917
19,0,"Beattie, Mr. Thomson",male,36.0000,13050,75.2417
20,1,"Beckwith, Mr. Richard Leonard",male,37.0000,11751,52.5542
21,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0000,11751,52.5542
22,1,"Behr, Mr. Karl Howell",male,26.0000,111369,30.0000
23,1,"Bidois, Miss. Rosalie",female,42.0000,PC 17757,227.5250
24,1,"Bird, Miss. Ellen",female,29.0000,PC 17483,221.7792
25,0,"Birnbaum, Mr. Jakob",male,25.0000,13905,26.0000
26,1,"Bishop, Mr. Dickinson H",male,25.0000,11967,91.0792
27,1,"Bishop, Mrs. Dickinson H (Helen Walton)",female,19.0000,11967,91.0792
28,1,"Bissette, Miss. Amelia",female,35.0000,PC 17760,135.6333
29,1,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.0000,110564,26.5500
...,...,...,...,...,...,...
1278,0,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0000,350406,7.8542
1279,0,"Vovk, Mr. Janko",male,22.0000,349252,7.8958
1280,0,"Waelens, Mr. Achille",male,22.0000,345767,9.0000
1281,0,"Ware, Mr. Frederick",male,NaN,359309,8.0500
1282,0,"Warren, Mr. Charles William",male,NaN,C.A. 49867,7.5500
1283,0,"Webber, Mr. James",male,NaN,SOTON/OQ 3101316,8.0500
1284,0,"Wenzel, Mr. Linhart",male,32.5000,345775,9.5000
1285,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0000,2688,7.2292
1286,0,"Widegren, Mr. Carl/Charles Peter",male,51.0000,347064,7.7500
1287,0,"Wiklund, Mr. Jakob Alfred",male,18.0000,3101267,6.4958
1288,0,"Wiklund, Mr. Karl Johan",male,21.0000,3101266,6.4958
1289,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0000,363272,7.0000
1290,0,"Willer, Mr. Aaron (""Abi Weller"")",male,NaN,3410,8.7125
1291,0,"Willey, Mr. Edward",male,NaN,S.O./P.P. 751,7.5500
1292,0,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,A/5 2466,8.0500
1293,0,"Williams, Mr. Leslie",male,28.5000,54636,16.1000
1294,0,"Windelov, Mr. Einar",male,21.0000,SOTON/OQ 3101317,7.2500
1295,0,"Wirz, Mr. Albert",male,27.0000,315154,8.6625
1296,0,"Wiseman, Mr. Phillippe",male,NaN,A/4. 34244,7.2500
1297,0,"Wittevrongel, Mr. Camille",male,36.0000,345771,9.5000
1298,0,"Yasbeck, Mr. Antoni",male,27.0000,2659,14.4542
1299,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0000,2659,14.4542
1300,0,"Youseff, Mr. Gerious",male,45.5000,2628,7.2250
1301,0,"Yousif, Mr. Wazli",male,NaN,2647,7.2250
1302,0,"Yousseff, Mr. Gerious",male,NaN,2627,14.4583
1303,0,"Zabour, Miss. Hileni",female,14.5000,2665,14.4542
1304,0,"Zabour, Miss. Thamine",female,NaN,2665,14.4542
1305,0,"Zakarian, Mr. Mapriededer",male,26.5000,2656,7.2250
1306,0,"Zakarian, Mr. Ortin",male,27.0000,2670,7.2250
1307,0,"Zimmerman, Mr. Leo",male,29.0000,315082,7.8750

In [ ]:


## columns
{'survived': [1, 0], 
 'name': [A], 
 'sex': [], 
 'age': [], 
 'ticket': [], 
 'fare': []}


# pd.DataFrame(data,columns=['survived', 'name', 'sex', 'age', 'ticket', 'fare'])

## tanic.loc([3], [4])
## tanic.iloc()